#include"Administrator.h"

void Administrator::show_menu()
{
	cout << "欢迎管理员<" << this->user_id << ">的登录!" << endl;
	cout << "---------------------------------------------------------------------------------------" << endl;
	cout << "-                                                                                     -" << endl;
	cout << "-                         ***********************************                         -" << endl;
	cout << "-                         **********1、添加账户信息**********                         -" << endl;
	cout << "-                         **********2、查看账号信息**********                         -" << endl;
	cout << "-                         **********3、查看使用记录**********                         -" << endl;
	cout << "-                         **********4、查看机房状态**********                         -" << endl;
	cout << "-                         **********5、清空使用记录**********                         -" << endl;
	cout << "-                         **********6、修改账号密码**********                         -" << endl;
	cout << "-                         **********7、注销登录信息**********                         -" << endl;
	cout << "-                         ***********************************                         -" << endl;
	cout << "-                                                                                     -" << endl;
	cout << "---------------------------------------------------------------------------------------" << endl;
}

void Administrator::changePas(string password)
{
	this->user_password = password;
}
